Public Attributes | List of all members
API_RailingQuantity Struct Reference
Element Manager
Calculated values for a railing. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | area
The area of the railing.
 double  | volume
The volume of the given railing.
 double  | length3D
The length of the 3D reference line of the railing.
Detailed Description
Calculated values for a railing.